---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
source: html/72274df3-991c-ad5a-1b57-a84a72df137d.htm
---
# RebarShapeDefinitionByArc Properties

Report whether the shape definition is fully
 constrained.